using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace practice8
{
    class Program
    {
     /// <summary>
     /// 27.	Граф задан списком вершин и ребер. 
     ///        Найти в нем какую-либо клику из K вершин
     /// Реализовать программу, решающую задачу, соответствующую Вашему варианту.
     /// Для тестирования программы разработать генератор тестов, который позволит сгенерировать набор входных данных, используемых при тестировании.
     ///    клика - подмножество, где любые две вершины подмножества соединены ребром 
     /// </summary>
     /// <param name="args"></param>
        static void Main(string[] args)
        {
            Console.WriteLine("Ввод количества рёбер");
            int N = int.Parse(Console.ReadLine());
        }
    }
}
